import { Link } from "react-router-dom"

function TermsOfService() {
    return (
        <>
            <header style={{boxShadow: '0 2px 2px #091E3F1A', display: 'grid', gridTemplateColumns: '1fr auto 1fr', alignItems: 'center'}}>
                <p style={{fontFamily: '"Abril Fatface", serif', fontWeight: 400, padding: '19px 15px', margin: '0', justifyContent: 'start'}}>BR</p>
                <p style={{fontWeight: 600, fontSize: '18px', color: '#242A37', margin: '0', textDecoration: 'uppercase', justifyContent: 'center'}}>
                    Умови використання для інтернет сайту Book Reading
                </p>
            </header>
            <div style={{fontFamily: 'Montserrat, serif', fontWeight: 400, fontSize: '14px', color: '#242A37', width: '700px', marginLeft: 'calc(50% - 350px)'}}>
                <p style={{fontWeight: 500, fontSize: '16px', margin: '20px 0'}}>
                    1. Book Reading – це навчальний проект, розроблений для демонстраційних цілей.
                </p>
                <p style={{fontWeight: 500, fontSize: '16px', margin: '0'}}>
                    2. Використовуючи Сайт, ви погоджуєтеся дотримуватися цих Умов. Якщо ви не згодні з будь-якою частиною цих Умов, ви не можете використовувати Сайт. 
                </p>
                <p style={{fontWeight: 500,fontSize: '16px', margin: '10px 0 0'}}>
                    3. Що Сайт може вимагати від вас:
                </p>
                <p style={{margin: '10px 0 0'}}>
                    3.1 Сайт вимагае вход через ваш обліковий запис Google чи через ваш створений облiковий запис на сайтi. Ви погоджуєтеся використовувати цi метод входу лише для цілей, для яких сайт був розроблений. <br />
                    3.2 При вході або реестрацii через Google, сайт може отримати доступ до деяких ваших даних Google (ім'я, адреса електронної пошти) відповідно до нашої Політики конфіденційності.  <br />
                    3.3 При стандартному входi, сайт може вимагати вашу пошту, пароль. <br />
                    3.4 При стандартнiй реестрацii, сайт може вимагати вашу пошту, пароль, та iм'я.
                </p>
                <p style={{fontWeight: 500,fontSize: '16px', margin: '10px 0 0'}}>
                    4. Використання сайту 
                </p>
                <p style={{margin: '0'}}>
                    4.1 Ви можете використовувати сайт лише для особистих, некомерційних, робочих та навчальних цілей. <br />
                    4.2 Ви погоджуєтеся не використовувати сайт у спосіб, що порушує будь-які закони, права третіх осіб або ці Умови.  <br />
                    4.3 Ви не можете використовувати сайт для створення, зберігання або поширення незаконного, шкідливого, образливого, наклепницького або непристойного контенту. <br />
                    4.4 Ви не можете намагатися отримати несанкціонований доступ до сайта, його серверів або пов'язаних систем.  <br />
                    4.5 Ви не можете використовувати знайдені помилки або вразливості в сайту з метою завдання шкоди, та зобов'язанi повiдомити про знайдені помилки через офіційну адресу: tstmlfrprjcts@gmail.com.
                </p>
                <p style={{fontWeight: 500,fontSize: '16px', margin: '10px 0 0'}}>
                    5. Інтелектуальна Власність: 
                </p>
                <p style={{margin: '0'}}>
                    5.1 Сайт та весь його вміст (за винятком контенту, наданого користувачами) є власністю Кривошеї Миколи Антоновича. 
                </p>
                <p style={{fontWeight: 500,fontSize: '16px', margin: '10px 0 0'}}>           
                    6. САЙТ НАДАЄТЬСЯ "ЯК Є" БЕЗ ЖОДНИХ ГАРАНТІЙ, ЯВНИХ ЧИ НЕПРЯМИХ. 
                </p>
                <p style={{margin: '0'}}>
                    6.1 Я не гарантую, що робота сайта буде безперебійним, безпомилковою або безпечною. Він може містити помилки або тимчасово бути недоступним. <br />
                    6.2 Оскільки це навчальний проєкт, Я не несу відповідальності за будь-які прямі, непрямі, випадкові, спеціальні або побічні збитки, що виникли внаслідок використання або неможливості використання сайта.  <br />
                    6.3 Я не несу відповідальності за можливу втрату даних, яка була надана під час використання Сайта.  
                </p>
                <p style={{fontWeight: 500,fontSize: '16px', margin: '10px 0 0'}}>           
                    7. Зміни до Умов 
                </p>
                <p style={{margin: '0'}}>
                    7.1 Я залишаю за собою право в будь-який час змінювати ці Умови без повiдомлення. Ваше подальше використання Сайта після внесення змін означає вашу згоду з переглянутими Умовами. <br />
                    7.2 Незнання Умов використання не звiльняе вiд вiдповiдальностi у разi їх порушення.
                </p>
                <p style={{fontWeight: 500,fontSize: '16px', margin: '10px 0 0'}}>           
                    8. Припинення Дії Облікового Запису 
                </p>
                <p style={{margin: '0'}}>
                    8.1 Я маю право призупинити або припинити ваш доступ до сайта в будь-який час і з будь-якої причини, без попередження, якщо ви порушите ці Умови. 
                </p>
                <p style={{fontWeight: 500,fontSize: '16px', margin: '10px 0 0'}}>           
                    9. Контактна Інформація
                </p>
                <p style={{margin: '0'}}> 
                    9.1 Якщо у вас виникли запитання щодо цих Умов використання, будь ласка, зв'яжіться зi мною за офiцiйною адресою: tstmlfrprjcts@gmail.com. 
                </p>
                <p style={{fontWeight: 500,fontSize: '16px', margin: '10px 0 0'}}>           
                    Останнє оновлення: 26.02.2026
                </p>
                <Link to="/login">
                    <button style={{backgroundColor: "#fff", border: '1px solid #242A37', width: '127px', height: '40px', cursor: 'pointer'}}>Увiйти</button>                                
                </Link>
                <Link to="/registration">
                    <button style={{margin: '20px 0 20px 445px', color: '#fff', backgroundColor: '#FF6B08', border: '0', fontFamily: '"Montserrat", serif', fontWeight: 500, fontSize: '14px', padding: '11px 23px', cursor: 'pointer'}}>Реєстрація</button>
                </Link>
            </div>
        </>
    )
}

export default TermsOfService